app/controllers/books_controller.rb

INSERT INTO "books" ("title", "user_id", "created_at", "updated_at", "opinion") VALUES (?, ?, ?, ?, ?)  [["title", "aaaaaaaaaa"], ["user_id", 6], ["created_at", "2021-11-01 12:08:42.839344"], ["updated_at", "2021-11-01 12:08:42.839344"], ["opinion", "aaaaaaaaaaa"]]
SELECT "books".* FROM "books"
---
  def create
    @book=Book.new(book_params)
    @book.user_id=current_user.id
    if @book.save
       flash[:notice] = "You have created book successfully."
      redirect_to book_path(@book.id)
    else
      @user=current_user
      @books=Book.all

SELECT "books".* FROM "books"
---
  def index
    @user=current_user
    @books=Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
---
  def show
    @new_book=Book.new
    @book=Book.find(params[:id])