app/controllers/users_controller.rb

  def index
    @user=User.where(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]